; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v5 - type_3 ?v2 - type_1)
 	      (pred_3 ?v7 - object ?v2 - type_1)
	      (pred_2 ?v5 - type_3 ?v1 - type_2)
	      (pred_4 ?v5 - type_3 ?v7 - object ?v1 - type_2))

   (:action op_3
       :parameters  (?v5 - type_3 ?v3 ?v6 - type_1)
       :precondition (and  (pred_1 ?v5 ?v3))
       :effect (and  (pred_1 ?v5 ?v6)
		     (not (pred_1 ?v5 ?v3))))

   (:action op_2
       :parameters (?v5 - type_3 ?v4 - object ?v8 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v8) (pred_1 ?v5 ?v8) (pred_2 ?v5 ?v1))
       :effect (and (pred_4 ?v5 ?v4 ?v1)
		    (not (pred_3 ?v4 ?v8)) 
		    (not (pred_2 ?v5 ?v1))))

   (:action op_1
       :parameters (?v5 - type_3 ?v4 - object ?v8 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v4 ?v1) (pred_1 ?v5 ?v8))
       :effect (and (pred_3 ?v4 ?v8)
		    (pred_2 ?v5 ?v1)
		    (not (pred_4 ?v5 ?v4 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_07 - type_3
obj_06 obj_01 - type_2
obj_05 obj_09 obj_08 - type_1
obj_04 obj_02 obj_03 - object)
(:init
(pred_1 obj_07 obj_05)
(pred_2 obj_07 obj_06)
(pred_2 obj_07 obj_01)
(pred_3 obj_04 obj_09)
(pred_3 obj_02 obj_05)
(pred_3 obj_03 obj_08)
)
(:goal
(and
(pred_3 obj_04 obj_05)
(pred_3 obj_02 obj_09)
(pred_3 obj_03 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_07 ?b obj_01))))
)
)

; plan
1. (op_2 obj_07 obj_02 obj_05 obj_06)
   deleted: (pred_3 obj_02 obj_05) (pred_2 obj_07 obj_06)
   added: (pred_4 obj_07 obj_02 obj_06)
   goals met: 0 of 3
2. (op_3 obj_07 obj_05 obj_09)
   deleted: (pred_1 obj_07 obj_05)
   added: (pred_1 obj_07 obj_09)
   goals met: 0 of 3
3. (op_1 obj_07 obj_02 obj_09 obj_06)
   deleted: (pred_4 obj_07 obj_02 obj_06)
   added: (pred_3 obj_02 obj_09) (pred_2 obj_07 obj_06)
   goals met: 1 of 3
4. (op_2 obj_07 obj_04 obj_09 obj_06)
   deleted: (pred_3 obj_04 obj_09) (pred_2 obj_07 obj_06)
   added: (pred_4 obj_07 obj_04 obj_06)
   goals met: 1 of 3
5. (op_3 obj_07 obj_09 obj_05)
   deleted: (pred_1 obj_07 obj_09)
   added: (pred_1 obj_07 obj_05)
   goals met: 1 of 3
6. (op_1 obj_07 obj_04 obj_05 obj_06)
   deleted: (pred_4 obj_07 obj_04 obj_06)
   added: (pred_3 obj_04 obj_05) (pred_2 obj_07 obj_06)
   goals met: 2 of 3
7. (op_3 obj_07 obj_05 obj_08)
   deleted: (pred_1 obj_07 obj_05)
   added: (pred_1 obj_07 obj_08)
   goals met: 2 of 3
8. (op_2 obj_07 obj_03 obj_08 obj_06)
   deleted: (pred_3 obj_03 obj_08) (pred_2 obj_07 obj_06)
   added: (pred_4 obj_07 obj_03 obj_06)
   goals met: 2 of 3
9. (op_3 obj_07 obj_08 obj_09)
   deleted: (pred_1 obj_07 obj_08)
   added: (pred_1 obj_07 obj_09)
   goals met: 2 of 3
10. (op_1 obj_07 obj_03 obj_09 obj_06)
   deleted: (pred_4 obj_07 obj_03 obj_06)
   added: (pred_3 obj_03 obj_09) (pred_2 obj_07 obj_06)
   goals met: 3 of 3
